; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v6)
             (pred_5 ?v5 ?v11)
             (pred_12 ?v8 ?v11)
             (pred_4 ?v1 ?v8 )
	     (pred_3 ?v8)
             (pred_9 ?v3)
             (pred_8 ?v5)
             (pred_1 ?v11)
             (pred_11 ?v8)
             (pred_10 ?v5)
             (pred_6 ?v8)
             (pred_7 ))



(:action op_2
:parameters (?v2 ?v12 ?v7 ?v10)
:precondition (and (pred_9 ?v2) (pred_9 ?v12) (pred_8 ?v7) (pred_1 ?v10)
          (pred_2 ?v2 ?v12) (pred_5 ?v7 ?v10)
                   (pred_12 ?v12 ?v10) (pred_3 ?v2) 
                   (pred_11 ?v12) (pred_10 ?v7))
:effect (and  (pred_6 ?v12) (not (pred_11 ?v12))))


(:action op_1
:parameters (?v2 ?v13)
:precondition (and (pred_9 ?v2) (pred_9 ?v13)
               (pred_3 ?v2) (pred_2 ?v2 ?v13) (pred_6 ?v13))
:effect (and (pred_3 ?v13) (not (pred_3 ?v2))))

(:action op_5
:parameters (?v2 ?v7)
:precondition (and (pred_9 ?v2) (pred_8 ?v7) 
                  (pred_3 ?v2) (pred_4 ?v7 ?v2) (pred_7 ))
:effect (and (pred_10 ?v7)
   (not (pred_4 ?v7 ?v2)) (not (pred_7 ))))


(:action op_3
:parameters (?v2 ?v4 ?v9)
:precondition (and (pred_9 ?v2) (pred_8 ?v4) (pred_8 ?v9)
                  (pred_3 ?v2) (pred_10 ?v9) (pred_4 ?v4 ?v2))
:effect (and (pred_10 ?v4) (pred_4 ?v9 ?v2)
        (not (pred_10 ?v9)) (not (pred_4 ?v4 ?v2))))

(:action op_4
:parameters (?v2 ?v7)
:precondition (and (pred_9 ?v2) (pred_8 ?v7) 
                  (pred_3 ?v2) (pred_10 ?v7))
:effect (and (pred_7 ) (pred_4 ?v7 ?v2) (not (pred_10 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_08 obj_13 obj_06 obj_11 obj_02 obj_18 obj_05 obj_16 obj_01 obj_20 obj_04 obj_12 obj_09 obj_07 obj_10
    obj_15 obj_17
    obj_03 obj_14
    )

    (:init
       (pred_7)

       (pred_9 obj_19)
       (pred_9 obj_08)
       (pred_9 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_18)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_01)
       (pred_9 obj_20)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_10)
       (pred_1 obj_15)
       (pred_1 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_14)

       (pred_2 obj_19 obj_11)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_08 obj_02)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_13 obj_18)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_19)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_18 obj_13)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_18)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_01 obj_20)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_01)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_09 obj_07)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_07 obj_10)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_07 obj_09)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_07)
       (pred_11 obj_07)
       (pred_11 obj_04)
       (pred_12  obj_07 obj_15)
       (pred_12  obj_04 obj_17)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_13)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_20)
       (pred_6 obj_12)
       (pred_6 obj_09)
       (pred_6 obj_10)

       (pred_5  obj_03 obj_15)
       (pred_5  obj_14 obj_17)
       (pred_4 obj_03 obj_19)
       (pred_4 obj_14 obj_20)
       (pred_3 obj_13)
    )

    (:goal (and
       (pred_4 obj_03 obj_07)
    ))
(:constraints
  (always (not (pred_3 obj_08)))
)
)

; plan
1. (op_1 obj_13 obj_18)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_02)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_11)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_11)
   goals met: 0 of 1
4. (op_1 obj_11 obj_19)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_03)
   deleted: (pred_4 obj_03 obj_19) (pred_7)
   added: (pred_10 obj_03)
   goals met: 0 of 1
6. (op_1 obj_19 obj_11)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_11)
   goals met: 0 of 1
7. (op_1 obj_11 obj_02)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_02)
   goals met: 0 of 1
8. (op_1 obj_02 obj_18)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_18)
   goals met: 0 of 1
9. (op_1 obj_18 obj_20)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_20)
   goals met: 0 of 1
10. (op_2 obj_20 obj_07 obj_03 obj_15)
   deleted: (pred_11 obj_07)
   added: (pred_6 obj_07)
   goals met: 0 of 1
11. (op_1 obj_20 obj_07)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_07)
   goals met: 0 of 1
12. (op_4 obj_07 obj_03)
   deleted: (pred_10 obj_03)
   added: (pred_7) (pred_4 obj_03 obj_07)
   goals met: 1 of 1
